# Part 2: Python

#### binary, octal, hexadecimal

In [184]:
print(bin(50),oct(50),hex(50))

0b110010 0o62 0x32

## Pandas

In [164]:
import pandas as pd
import numpy as np

In [165]:
cast = pd.read_csv(r'C:\Users\guyit\Desktop\אור אוניברסיטה\מבוא למדעי הנתונים\עבודת גמר\cast.csv')
cast

,title,year,name,type,character,n
0,Suuri illusioni,1985,Homo $,actor,Guests,22.0
1,Gangsta Rap: The Glockumentary,2007,Too $hort,actor,Himself,NaN
2,Menace II Society,1993,Too $hort,actor,Lew-Loc,27.0
3,Porndogs: The Adventures of Sadie,2009,Too $hort,actor,Bosco,3.0
4,Stop Pepper Palmer,2014,Too $hort,actor,Himself,NaN
...,...,...,...,...,...,...
3333690,Stuttur Frakki,1993,Sveinbj?rg ??rhallsd?ttir,actress,Flugfreyja,24.0
3333691,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3333692,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3333693,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3333694,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

### Question 1
#### How many movies have the title "Hamlet"?

In [166]:
g_cast= cast.groupby('title')

In [167]:
title_Hamlet = g_cast.get_group('Hamlet')
len(title_Hamlet)

299

### Question 2
#### List all of the "Treasure Island" movies from earliest to most recent.

In [168]:
title_Treasure = g_cast.get_group('Treasure Island')

In [169]:
title_Treasure.sort_values(by=['year'])

,title,year,name,type,character,n
1312766,Treasure Island,1918,Herschel Mayall,actor,Prologue Player,NaN
3280557,Treasure Island,1918,Eleanor Washington,actress,Prologue Player,NaN
3046750,Treasure Island,1918,Violet Radcliffe,actress,Long John Silver,3.0
1167783,Treasure Island,1918,Raymond Lee,actor,Bit Role,NaN
1195421,Treasure Island,1918,Elmo Lincoln,actor,Prologue Player,NaN
...,...,...,...,...,...,...
1663860,Treasure Island,1999,Victor Raider-Wexler,actor,Samowitz,10.0
1731182,Treasure Island,1999,Scot Thomas Robinson,actor,Jimmy,11.0
1813707,Treasure Island,1999,Richard Schave,actor,Man,21.0
2710458,Treasure Island,1999,Stephanie Ittleson,actress,Stella,7.0
815338,Treasure Island,1999,Rio Hackford,actor,Hans,23.0

### Question 3
#### How many roles were credited in the silent 1921 version of Hamlet?

In [170]:
title_Hamlet_year = title_Hamlet.groupby('year')
len(title_Hamlet_year.get_group(1921))

9

### Question 4
#### Use groupby() to plot the number of "Hamlet" films made each decade

In [171]:
title_Hamlet_decade = th.groupby(pd.cut(title_Hamlet["year"],np.arange(1900,2021,10)))
title_Hamlet_decade.size()

year
(1900, 1910]     1
(1910, 1920]    27
(1920, 1930]     9
(1930, 1940]     0
(1940, 1950]    25
(1950, 1960]     1
(1960, 1970]    57
(1970, 1980]    19
(1980, 1990]    32
(1990, 2000]    93
(2000, 2010]    17
(2010, 2020]    18
dtype: int64

### Question 5
#### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [172]:
g_role = cast.groupby('n')
mainRole = g_role.get_group(1)
g_mainRole_type = mainRole.groupby('type')

In [173]:
#leading roles available to actors
actor = g_mainRole_type.get_group('actor')
actor_g = actors.groupby(pd.cut(actor["year"],np.arange(1950,1961)))
actor_g.size()

year
(1950, 1951]    633
(1951, 1952]    591
(1952, 1953]    634
(1953, 1954]    626
(1954, 1955]    606
(1955, 1956]    614
(1956, 1957]    708
(1957, 1958]    694
(1958, 1959]    678
(1959, 1960]    673
dtype: int64

In [174]:
#leading roles available to actress
actress = g_mainRole_type.get_group('actress')
actress_g=actress.groupby(pd.cut(actress["year"],np.arange(1950,1961)))
actress_g.size()

year
(1950, 1951]    272
(1951, 1952]    284
(1952, 1953]    290
(1953, 1954]    298
(1954, 1955]    264
(1955, 1956]    288
(1956, 1957]    284
(1957, 1958]    275
(1958, 1959]    287
(1959, 1960]    287
dtype: int64

### Question 6
#### List the 10 actors/actresses that have the most leading roles (n=1) since the 1990's.

In [175]:
x = cast.groupby(['n'])
y = x.get_group(1)
y=y[y['year']>=1990]
y

,title,year,name,type,character,n
88,Live Freaky Die Freaky,2006,Nick 13,actor,TV Reporter #1,1.0
125,All Things Fall Apart,2011,50 Cent,actor,Deon,1.0
130,Freelancers,2012,50 Cent,actor,Malo,1.0
131,Get Rich or Die Tryin',2005,50 Cent,actor,Marcus,1.0
132,Gun,2010,50 Cent,actor,Rich,1.0
...,...,...,...,...,...,...
3333400,120,2008,?zge ?zberk,actress,M?nire,1.0
3333513,Doyumsuz,1990,Bahar ?ztan,actress,Bahar,1.0
3333522,Kadife,2012,Ayta? ?ztuna,actress,Kadife Ana,1.0
3333556,Dig og mig,2008,Julie R. ?lgaard,actress,Stephanie,1.0
3333576,Mimi og madammerne,1998,Tammi ?st,actress,Mimi,1.0

In [176]:
a = y.groupby('name')
b = a.size()
b.sort_values(ascending=False,inplace=True)
b.head(10)

name
Mohanlal              126
Mammootty             118
Akshay Kumar           87
Jayaram                76
Andy Lau               72
Ajay Devgn             69
Eric Roberts           68
Amitabh Bachchan       68
Nagarjuna Akkineni     60
Dilip                  59
dtype: int64

### Question 7
#### List, in order by year, each of the films in which Frank Oz has played more than 1 role

In [181]:
names = cast.groupby('name')
frank = names.get_group('Frank Oz')
frank.sort_values(by=['year'])
times = frank.groupby('title')

In [183]:
z=times.count()
z[z['n']>1]['n']

title
An American Werewolf in London              2
Muppet Treasure Island                      4
Muppets from Space                          4
Sesame Street Presents: Follow that Bird    3
The Adventures of Elmo in Grouchland        3
The Dark Crystal                            2
The Great Muppet Caper                      6
The Muppet Christmas Carol                  7
The Muppet Movie                            8
The Muppets Take Manhattan                  7
Name: n, dtype: int64